# STD-YOLO Model Configuration
# YOLOv8-based with P2 small object detection layer, CARAFE upsampling,
# enhanced SPPF, and attention mechanisms

# Parameters
nc: 1               # number of classes
scales:             # model scale (width, depth, max_channels)
  n: [0.50, 0.50, 1024]   # nano
  s: [0.50, 0.50, 1024]   # small  (default)
  m: [0.75, 0.75, 1024]   # medium
  l: [1.00, 1.00, 1024]   # large
  x: [1.25, 1.25, 1024]   # xlarge

# Backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]]           # 0: P1/2
  - [-1, 1, Conv, [32, 3, 2]]           # 1: P2/4
  - [-1, 3, C2f, [64, True]]            # 2
  - [-1, 1, Conv, [64, 3, 2]]           # 3: P3/8
  - [-1, 6, C2f, [128, True]]           # 4
  - [-1, 1, Conv, [128, 3, 2]]          # 5: P4/16
  - [-1, 6, C2f, [256, True]]           # 6
  - [-1, 1, Conv, [256, 3, 2]]          # 7: P5/32
  - [-1, 3, C2f, [512, True]]           # 8
  - [-1, 1, SPPFCustom, [512, 5, 4]]    # 9: Enhanced SPPF

# Head (Neck + Detection)
head:
  - [-1, 1, CARAFE_UP, [256]]            # 10: Upsample P5 -> P4
  - [[-1, 6], 1, Concat, [1]]            # 11: Concat with P4
  - [-1, 3, C2f, [256, False]]           # 12: Neck P4

  - [-1, 1, CARAFE_UP, [128]]            # 13: Upsample P4 -> P3
  - [[-1, 4], 1, Concat, [1]]            # 14: Concat with P3
  - [-1, 3, C2f, [128, False]]           # 15: Neck P3

  - [-1, 1, CARAFE_UP, [64]]             # 16: Upsample P3 -> P2 (small object)
  - [[-1, 2], 1, Concat, [1]]            # 17: Concat with P2
  - [-1, 3, C2f, [64, False]]            # 18: Neck P2 (small object branch)

  - [-1, 1, Conv, [64, 3, 2]]            # 19: Downsample P2 -> P3
  - [[-1, 15], 1, Concat, [1]]           # 20: Concat with P3 neck
  - [-1, 3, C2f, [128, False]]           # 21: Neck P3

  - [-1, 1, Conv, [128, 3, 2]]           # 22: Downsample P3 -> P4
  - [[-1, 12], 1, Concat, [1]]           # 23: Concat with P4 neck
  - [-1, 3, C2f, [256, False]]           # 24: Neck P4

  - [-1, 1, Conv, [256, 3, 2]]           # 25: Downsample P4 -> P5
  - [[-1, 9], 1, Concat, [1]]            # 26: Concat with P5 (backbone)
  - [-1, 3, C2f, [512, False]]           # 27: Neck P5

  # Detection heads: P2, P3, P4, P5
  - [[18, 21, 24, 27], 1, Detect, [nc]]  # 28: Detect(P2, P3, P4, P5)
